"16" = "Cannot install without your .qt-license file in your Home directory. Please check your installation instructions.";
"17" = "Invalid .qt-license file. Please verify that your .qt-license file contains a valid Qt 4 product key.";
"18" = "We are sorry, but your license key is not valid for the Mac platform. Please verify the license key in your .qt-license file.";
"19" = "The binary package can only be installed on Mac OS X version 10.3.9 or higher.";
"20" = "You are no longer licensed to use this version of Qt. Please contact sales@trolltech.com to renew your support and upgrades for this license.";
"21" = " Your Evaluation license has expired. You are no longer licensed to use this software. Please contact sales@trolltech.com to purchase license, or install the Qt Open Source Edition if you intend to develop free software.";